export default function ProjectInfoPage() {
    return (
        <div style={{
            maxWidth: "800px",
            margin: "0 auto",
            padding: "2rem",
            lineHeight: 1.6
        }}>
            <h1>Информация о проекте</h1>

            {/* Версия проекта */}
            <section style={{ marginBottom: "2rem" }}>
                <h2>Версия проекта</h2>
                <p>Текущая версия: <strong>2.0.0</strong> <strong style={{color: "#911313", border: "1px solid #bbb"}}>beta</strong></p>
            </section>

            {/* Что сделано */}
            <section style={{ marginBottom: "2rem" }}>
                <h2>Что нового</h2>
                <ul>
                    <li>Удаление предмета и изображения</li>
                    <li>Сортировка по дате, приоритету, сумме</li>
                    <li>Вывод валюты в список предметов</li>
                    <li>Смена типа поля суммы со строки на число</li>
                    <li>Единая точка переключения страниц в проекте фронтенда</li>
                    <li>Возвращение товаров из COMPLETED в OPEN</li>
                </ul>
            </section>

            {/* Известные проблемы */}
            <section style={{ marginBottom: "2rem" }}>
                <h2>В следующих релизах</h2>
                <ul>
                    <li><strong>Скрипты миграций!</strong></li>
                    <li>Подписка на пользователя</li>
                    <li>Отображение подписок пользователей</li>
                    <li>Отображение человеческих ошибок с детализацией</li>
                    <li>возвращение товара из отмененных в "открытые"</li>
                    <li>добавление поля обратной связи по багам (будут выводиться здесь в списке)</li>
                </ul>
            </section>

            {/* Другая информация */}
            <section style={{ marginBottom: "2rem" }}>
                <h2>Дополнительная информация</h2>
                <p>
                    <strong>Это все еще тестовый режим - не все базовые фичи реализованы</strong>
                </p>
            </section>

            <br/>
            {/* Прошедшие релизы */}
            <section style={{marginBottom: "2rem"}}>
                <h1>История релизов</h1>
                <h2>1.1.0-beta</h2>
                <ul>
                    <li>Загрузка изображения через multipart (ограничение размера 140кб)</li>
                    <li>Темная тема</li>
                    <li>Единый стиль</li>
                    <li>Убран лаг добавки предметов после авторизации</li>
                    <li>Пофикшен баг кнопки отмены добавления нового предмета</li>
                    <li>Пофикшен баг вывода открытых предметов при обновлении страницы</li>
                    <li>Градация приоритетов с 0 до 10 и вывод уровня в списке предметов</li>
                    <li>Кнопка reset - снятие резерва с товара</li>
                    <li>Каталогизирование изображений и асинхронная очистка</li>
                    <li>Сокрытие смены статуса от других пользователей</li>
                    <li>Проверка токена в patch-методах по пользователю и времени жизни</li>
                    <li>Сокрытие статуса резерва от текущего пользователя</li>
                    <li>Страница обновления предмета</li>
                </ul>
                <h2>1.0.0-beta</h2>
                <ul>
                    <li>Добавлена регистрация пользователей</li>
                    <li>Реализована авторизация через JWT</li>
                    <li>Добавлена возможность создавать предметы</li>
                    <li>Добавлена страница детализации предмета</li>
                    <li>Добавлена возможность изменять статусы и резервировать предметы</li>
                </ul>
            </section>
        </div>
    );
}
